package main

import (
	"fmt"
)

func main() {

	//1. Создать пакет mathutils с функцией для вычисления факториала числа.

	//2. Использовать созданный пакет для вычисления факториала введенного пользователем числа.

	//3. Создать пакет stringutils с функцией для переворота строки и использовать его в основной программе.

	//4. Написать программу, которая создает массив из 5 целых чисел, заполняет его значениями и выводит их на экран.

	//5. Создать срез из массива и выполнить операции добавления и удаления элементов.

	//6. Написать программу, которая создает срез из строк и находит самую длинную строку

	fmt.Println("\nКонец выполнения программы")
}
