package main

//5. Разработка многопоточного калькулятора:
//Напишите многопоточный калькулятор, который одновременно может обрабатывать запросы на выполнение простых операций (+, -, *, /).
//Используйте каналы для отправки запросов и возврата результатов.
//Организуйте взаимодействие между клиентскими запросами и серверной частью калькулятора с помощью горутин.

//что-то недосказано. я сделал по-факту горутины ввода и вывода, с какими-то дополнительными операциями
//в целом смогу доделать на паре, если скажут что конкретно нужно сделать

import (
	"fmt"
)

func main() {
	fmt.Println("Конец выполнения 6 задания")
}
