package main

//6. Создание пула воркеров:
//Реализуйте пул воркеров, обрабатывающих задачи (например, чтение строк из файла и их реверсирование).
//Количество воркеров задаётся пользователем.
//Распределение задач и сбор результатов осуществляется через каналы.
//Выведите результаты работы воркеров в итоговый файл или в консоль.

//понять бы. Все воркеры должны выполнять одну и туже операцию с одним и тем же файлом, просто не мешаю друг другу и не трогая уже сделанное?

import (
	"fmt"
)

func main() {

	fmt.Println("Конец выполнения 6 задания")
}
